import java.io.* ;


public class HomeWork_16_3 {

    public static void main(String[] args) {

        System.out.println("Home work 16");

        //Задача 3.
        // Сформируйте массив, который хранит названия дней недели при условии,
        // что первый рабочий день недели - это Понедельник, а последний - Воскресенье.
        // Переопределите этот массив так,
        // чтобы первым рабочим днем недели стало Воскресенье, а последним - Суббота.
        int n = 7;
        String[] day = {"Mo", "Di", "Mi", "Do", "Fr", "Sa", "So"};

        for (int i = 0; i < day.length; i++) {


        System.out.println(day + "|");
    }



        // находим элементы с четными индексами

        // for (int i = 0; i < num.length; i++) {

        //if (i % 2 != 0) {
        //  n++;
        //   continue;
        // }
        //  sum += num[i]; // сложение элементов
        //  average = sum / (n + 1);

        //   System.out.print(num[i] + "|");
    }
}
      //  System.out.println();
      //  System.out.println("Всего элементов:" + n);
       // System.out.println("Их сумма:" + sum);
      //  System.out.println("Средняя величина элементов с четными индексами: " + average);









